---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartNotAttachedToStraight
source: html/e55c4e37-9c8b-40d4-d545-ca71f10ccc60.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartNotAttachedToStraight Property

The part must be attached to straight.

## Syntax (C#)
```csharp
public static FailureDefinitionId FabricationPartNotAttachedToStraight { get; }
```